{"date":"2020-12-03T06:00:00.000Z","intro":"As the remote learning begins, <i>The Record</i> wants to focus on the community’s stories and connect everyone together even though we may be physically separated: how is your daily routine during online classes? What local news may be happening where you live? Look for an email later tonight with more information on how you can share your experiences. Have a good week.","emailPreview":"As the remote learning begins, The Record wants to focus on the community’s stories and connect everyone together even though we may be physically separated.","errata":"","articleOrder":[0,1,2,4,7,8],"highestID":8,"articles":[{"id":0,"title":"School’s Updated COVID-19 Plans Succeed","articleLink":"https://hotchkissrecord.org/2020/12/schools-updated-covid-19-plans-succeed/","byline":"James Yae ’23, Contributing Writer","contentPreview":"Stringent adherence to public health guidelines allowed the school to successfully complete a fall term with the majority of students and faculty on campus, despite a global pandemic that has infected over 63 million people.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/blaise_video-e1606888367723-900x594.png","thumbnailCaption":"Blaise Fleury ’21 & Peter Kallos ’22 filmed a video outlining rules for student visitation.","thumbnailCredit":"Blaise Fleury & Peter Kallos"},{"id":1,"title":"Community Voices: November Break: A Return to the World of the Unprecedented","articleLink":"https://hotchkissrecord.org/2020/12/november-break-a-return-to-the-world-of-the-unprecedented/","byline":"Sydney Goldstein ’22, Features Editor","contentPreview":"In April 2020, the Features editors started “Community Voices,” a subsection of Features giving contributors the freedom to submit personal vlogs, blogs, journal entries, poems, and other art addressing off-campus living during remote learning. “Community Voices” will return for remote learning this winter; <i>The Record</i> encourages all community members to contribute.","thumbnailLink":"","thumbnailCaption":"","thumbnailCredit":""},{"id":2,"title":"Community Voices: Hong Kong by the Sky","articleLink":"https://hotchkissrecord.org/2020/12/community-voices-hong-kong-by-the-sky/","byline":"Arhan Chhabra ’22, Design Editor","contentPreview":"Arhan Chhabra ’22 shot and edited this aerial video of Hong Kong over the summer of 2020. He used a DJI Mavic Air 2 drone to film it, followed by color-grading and editing over a period of a month. The video was selected by <i>Zolima City Magazine</i>, which commissioned him to continue the series and develop an upcoming project for an exhibition in Hong Kong.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/hongkong.png","thumbnailCaption":"","thumbnailCredit":"Arhan Chhabra ’22"},{"id":4,"title":"Community Voices: The Six Gentlemen of Shanghai","articleLink":"https://hotchkissrecord.org/2020/12/the-six-gentlemen-of-shanghai/","byline":"Eric Jin ’22, Features Editor","contentPreview":"What would happen if you put six reckless, self-indulging, and undisciplined kids under a roof for a few months?","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/IMG_3721.jpg","thumbnailCaption":"The view from Jin’s apartment.","thumbnailCredit":"Kenny Zhang ’22"},{"id":7,"title":"Student Artwork Feature","articleLink":"https://hotchkissrecord.org/2020/12/student-artwork-feature/","byline":"Yihan Ding ’22 & Stephanie Ge ’22, Arts & Leisure Editors","contentPreview":"This issue, the Arts & Leisure section features a selection of student artwork submissions highlighting elements of the visual arts curriculum, adjusting to remote learning again, and current global social issues.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/A-rainy-corner-of-Hong-Kong.jpg-Grace-Li.jpg","thumbnailCaption":"A rainy corner of Hong Kong","thumbnailCredit":"Grace Li ’21"},{"id":8,"title":"Boys Swimming Makes Waves","articleLink":"https://hotchkissrecord.org/2020/12/boys-swimming-makes-waves/","byline":"Carrie Cao ’23, Staff Writer","contentPreview":"Intensive off-season training this fall has allowed members of the Boys Swimming team to be in much better shape for the start of the winter season. “I think having two seasons with more or less the same people on the team created a stronger bond within the team,” said co-captain Jeffrey Lim ’21. ","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/11/swim-mvanmierlo.jpg","thumbnailCaption":"The team was restricted to a maximum of 20 people in the pool at once.","thumbnailCredit":"Matthijs van Mierlo  "}]}