{"date":"2020-12-17T06:00:00.000Z","intro":"We hope you enjoy our last issue of 2020, with community stories and perspectives from the remote learning period. Happy holidays, and have a great break.","emailPreview":"We hope you enjoy our last issue of 2020, with community stories and perspectives from the remote learning period.","errata":"","articleOrder":[0,3,4,1,2,5,6,7,9,8,10,11,12,13],"highestID":13,"articles":[{"id":0,"title":"St. Luke’s Gives to Local Community","articleLink":"https://hotchkissrecord.org/2020/12/st-lukes-gives-to-local-community/","byline":"Amelie Zhang ’23, Staff Writer","contentPreview":"Wood-burning and crystal-growing kits, bath bombs, and play sand dinosaurs were just a few of the items on registries for St. Luke’s annual toy drive.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/2019-12-17_16-22-51_184.jpeg","thumbnailCaption":"St. Luke’s Society organizes a toy drive for the local community every year. This year’s drive was held virtually.","thumbnailCredit":"Caroline Kenny-Burchfield"},{"id":1,"title":"COVID-19 Vaccines Arrive","articleLink":"https://hotchkissrecord.org/2020/12/covid-19-vaccines-arrive/","byline":"Parth Jain ’24, Contributing Writer","contentPreview":"In recent weeks, the rollout of several COVID-19 vaccines has been a beacon of hope for many as the number of global cases continues to rise.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/Screen-Shot-2020-12-16-at-2.52.23-PM.png","thumbnailCaption":"The Food and Drug Administration (FDA) granted the Pfizer-BioNTech vaccine Emergency Use Authorization on December 10.","thumbnailCredit":"Arhan Chhabra ’22"},{"id":2,"title":"Community Voices: Hotchkiss in Shanghai","articleLink":"https://hotchkissrecord.org/2020/12/community-voices-hotchkiss-in-shanghai/","byline":"Shannon Meng ’22, Contributing Writer","contentPreview":"“Community Voices” is a subsection of Features giving contributors the freedom to submit personal vlogs, blogs, journal entries, poems, and other art addressing off-campus living during remote learning. Shannon Meng ’22 vlogs about her experience living with fellow Hotchkiss students in Shanghai.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/Screen-Shot-2020-12-15-at-10.21.27-PM-e1608092522427.png","thumbnailCaption":"","thumbnailCredit":"Shannon Meng ’22"},{"id":3,"title":"BaHSA Panel Confronts Affirmative Action Myths","articleLink":"https://hotchkissrecord.org/2020/12/bahsa-panel-confronts-affirmative-action-myths/","byline":"Vivian Shi ’23, Contributing Writer","contentPreview":"With almost one million views, Vox’s video titled “What We Get Wrong about Affirmative Action” opened up the Black and Hispanic Student Association (BaHSA) meeting on Tuesday, December 8. BaHSA hosted a panel on the topic of affirmative action in the college admissions process. ","thumbnailLink":"","thumbnailCaption":"","thumbnailCredit":""},{"id":4,"title":"Community Conversation Covers LGBTQ+ Identity","articleLink":"https://hotchkissrecord.org/2020/12/community-conversation-covers-lgbtq-identity/","byline":"Lauren McLane ’23, Staff Writer","contentPreview":"“How can I tell if someone I know is part of the LGBTQ+ community?” was one of the questions submitted by an anonymous community member for the second Community Conversation of the school year.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/Record-Flag-Graphic-V2.jpg","thumbnailCaption":"","thumbnailCredit":"Arhan Chhabra ’22"},{"id":5,"title":"Women of Color Reshape American Politics","articleLink":"https://hotchkissrecord.org/2020/12/women-of-color-reshaping-american-politics/","byline":"Siri Nellutla ’23, Staff Writer","contentPreview":"In 1916, four years before women won the right to vote, the first woman was elected to the House of Representatives. Jeannette Rankin said, after winning the election, “I may be the first woman in Congress, but I won’t be the last.” There are now 127 women in Congress.<br> This month, Kamala Harris became the first female, the first South Asian, the first person of color, and the first child of immigrants to ever be elected vice president of the United States. Echoing Rankin’s words, Harris said in her victory speech, “While I may be the first woman in this office, I won’t be the last. Because every little girl watching tonight sees that this is a country of possibilities.” Harris winning is a testament to the persistence, struggles, and rise of women in American politics.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/image.png","thumbnailCaption":"Harris wore white during her victory speech, a reference to the women’s suffrage movement as a symbol of moral purity.","thumbnailCredit":"International Business Times"},{"id":6,"title":"In Defense of Controversial Literature","articleLink":"https://hotchkissrecord.org/2020/12/in-defense-of-controversial-literature/","byline":"Felix Bao ’21 & Sachin Umashankar ’21, Contributing Writers","contentPreview":"Nigerian novelist Chinua Achebe advocates for the omission of Joseph Conrad’s imperialist tale <i>Heart of Darkness</i> from the typical selection of classic literature, writing in <i>An Image of Africa</i>, “The question is whether a novel which celebrates…dehumanization, which depersonalizes a portion of the human race, can be called a great work of art.  Our answer is: No, it cannot.” Achebe is wrong. ","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/11/5968515949_744bfef952_b-567x900.jpg","thumbnailCaption":"","thumbnailCredit":"Flicker/cdrummbks"},{"id":7,"title":"Artist of the Issue: Angela Choi ’21","articleLink":"https://hotchkissrecord.org/2020/12/artist-of-the-issue-angela-choi-21/","byline":"Darina Huang ’23, Staff Writer","contentPreview":"Angela Choi ’21 is a four-year senior, violinist, concertmaster of the Hotchkiss Orchestra, and student at Juilliard Pre-College. Outside the classroom, she is a co-head of Songs for Smiles, board member of Students for Environmental Action, and proctor in Flinn dormitory.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/IMG_3218-900x600.jpg","thumbnailCaption":"Choi performs in Weill Recital Hall at Carnegie Hall.","thumbnailCredit":"Angela Choi"},{"id":8,"title":"Beneath the Base of the Monolith – An Analysis of 2001: A Space Odyssey","articleLink":"https://hotchkissrecord.org/2020/12/beneath-the-base-of-the-monolith-an-analysis-of-2001-a-space-odyssey/","byline":"Clark Dong ’22, Contributing Writer","contentPreview":"It has been more than half a century since the release of Stanley Kubrick’s 2001: A Space Odyssey, yet the majestic sci-fi film still leaves its audience perplexed today. This time-bending film revolves around the Monoliths, towering slabs of metallic entity. The film was ahead of its time. It differentiates itself from other sci-fi films of its time not only by the self-awareness and progressiveness in the ideologies of our existence, but also by the cinematography, production design, and the storyline’s sheer depth. It predicted modern technologies such as iPads and artificial intelligence, anticipated the struggle between man and machine, and inspired numerous modern sci-fi classics.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/AYugc-579x900.jpg","thumbnailCaption":"A mysterious recreation of the Monoliths from the film was recently found in the Utah desert.","thumbnailCredit":"Robert McCall"},{"id":9,"title":"Holiday Celebrations Spread Cheer","articleLink":"https://hotchkissrecord.org/2020/12/holiday-celebrations-spread-cheer/","byline":"Nithya Chundi ’23, Contributing Writer","contentPreview":"You can usually find students both eating Sno-Caps and using them for decoration at the annual Gingerbread House Build in the dining hall. This year, the school livestreamed the annual traditions of the Gingerbread House Build and Lessons and Carols.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/House13_1-900x599.jpg","thumbnailCaption":"The school usually holds the annual Gingerbread House Build in the Dining Hall. This year, community members decorated their houses over a Zoom call.","thumbnailCredit":"David Li ’21"},{"id":10,"title":"Athlete of the Issue: CJ Mitchell ’21","articleLink":"https://hotchkissrecord.org/2020/12/athlete-of-the-issue-cj-mitchell-21/","byline":"Carrie Cao ’23, Staff Writer","contentPreview":"CJ Mitchell is a four-year Senior and co-captain of the Boys Varsity Basketball team. Last winter, he earned the Founders All-League Award and an All-Star NEPSAC Class A Honorable Mention. Co-captain Aidan Rodgers ’21 said, “CJ is a great teammate. He is the first man over to pick someone up when they fall. He shows great passion and true leadership on and off the court. He is a fantastic mid-range jump shooter and can take the ball to the basket on bigger defenders.”","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/11982_cj-600x900.jpg","thumbnailCaption":"Mitchell in a March 4, 2020 game against Taft.","thumbnailCredit":"Mahmood Almadeh ’20"},{"id":11,"title":"A Look Back on An Unprecedented NFL Season","articleLink":"https://hotchkissrecord.org/2020/12/a-look-back-on-an-unprecedented-nfl-season/","byline":"Rebekah Oppenheimer ’24, Contributing Writer","contentPreview":"The 2020 NFL season has been one like no other. Whether it’s been the unexpected rise of the Pittsburgh Steelers, the not-so-unexpected collapse of the New York Jets, or the number of players who have contracted COVID-19, it’s fair to say that the 2020 NFL season has been one to remember. As teams head into Week 15 and approach the start of playoffs, there’s still a lot more football to be played.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/1607914385594-900x636.jpg","thumbnailCaption":"","thumbnailCredit":"Ein Jun ’22"},{"id":12,"title":"Working Out From Home!","articleLink":"https://hotchkissrecord.org/2020/12/working-out-from-home/","byline":"Megan Ho ’23, Contributing Writer","contentPreview":"With the semester finishing off virtually, how will members of the community stay active? Three athletes tell us how they balance online learning with workouts.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/working_out_from_home-900x675.jpeg","thumbnailCaption":"Bullock and her family built an ice rink in her backyard so she could practice hockey.","thumbnailCredit":"Lydia Bullock"},{"id":13,"title":"Alex Cheng’s NBA Power Rankings","articleLink":"https://hotchkissrecord.org/2020/12/alex-chengs-nba-power-rankings/","byline":"Alex Cheng ’23, Staff Writer","contentPreview":"The 2020-2021 National Basketball Association (NBA) season will return on December 22 with the results from the previous season, the draft, and free agency still simmering. During an expedited off-season, exciting, promising talent was drafted, rumors buzzed around, and big free agents wobbled the NBA landscape. The Eastern Conference will be the most competitive top to bottom that it has been in over a decade, and the powerhouses which comprise the Western Conference make the upcoming season one of fierce competition and uncertainty. Below are my power rankings.","thumbnailLink":"https://hotchkissrecord.org/wp-content/uploads/2020/12/IMG_0663-900x628.jpg","thumbnailCaption":"","thumbnailCredit":"Claire Wang ’21"}]}